const termins_link = "https://discord.com/channels/1013085279583744050/1247877398368616530/1143131501337268244";
export const rules = {
	"ТЕРМ": {
		0: "Основные термины",
		1: [
			"**`Спам`** *(нарушение)* - сообщения рекламного характера (например, реклама или __соообщения о поиске персонала / партнёров__ для своего сервера)\n**`Флуд`** *(нарушение)* - отправка большого количества однотипных сообщений (например, \"привет\" 5 раз)\n**`Оффтоп`** *(нарушение)* - сообщения не по теме канала. Существует тематический оффтоп (\"привет\" в жалобы) и абсолютный (полная бессмыслица, т.е. \"впауквпкп пакпа крн\")\n**`Пред / Варн`** *(наказание)* - предупреждение. Низшая форма наказания, при которой никаких ограничений не накладывается. Служит своеобразной \"заметкой\" для других стражей порядка\n**`Мут`** *(наказание)* - то же самое, что и тайм-аут (timeout). Временная блокировка возможности отправлять сообщения в любые каналы сервера.\n**`Кик`** *(наказание)* - специфичная мера пресечения. Чаще всего применяется по отношению к спам-ботам\n**`Лок`** *(наказание)* - перманентный мут определённого канала\n**`Бан`** *(наказание)* - обойдёмся без объяснений, всё и так ясно",
			undefined
		]
	},
	1: {
		0: "Спам, флуд, оффтоп, капс",
		1: [
			`__Нельзя [спамить](${termins_link})__ или __рекламировать__ свои ненужные проекты другим людям. Люди вас не просили об этом. __Заметочка:__ если вы не поняли, запрещается *любая* реклама, в том числе глупые попытки обойти правила, написав "загляните в мой профиль", наивно надеясь, что кто-то перейдёт по ссылке в нём`,
			"Спам/реклама"
		],
		2: [
			`__Категорически запрещается [флудить](${termins_link})__ в любые каналы сервера, включая канал для команд бота.`,
			"Флуд"
		],
		3: [
			`__Нельзя [оффтопить](${termins_link})__ в любые каналы сервера, тем более в тематические, например, жалобы. Я знаю, найдутся ведь люди, которые напишут "привет" в жалобы, и их это совсем не смутит, потому что они сами не знают, что и куда они пишут`,
			"Оффтоп"
		],
		4: [
			`__Не стоит злоупотреблять [капсом](${termins_link})__. Никто не любит, когда на него орут, даже буквами`,
			"Капс"
		]
	},
	2: {
		0: "Оскорбления, неадекватное поведение, троллинг",
		1: [
			`Евангелие гласит: "Относитесь к людям так же, как хотите, чтобы относились к вам". __Не оскорбляйте__ кого-либо, чьх-то близких или родных. Речь идёт не про "шуточные" оскорбления (дурачок, глупышка и пр.) или дружеские оскорбления друзей, а про те, что действительно могут задеть человека или даже испортить ему день. Не будьте извергами и проявляйте человечность`,
			"Оскорбления"
		],
		2: [
			"__Старайтесь вести себя адекватно__. Никто не запрещает дурачиться в меру - главное вовремя остановиться и не творить дичь. Все мы прекрасно знаем, как раздражают люди в неадекватном состоянии",
			"Неадекватное поведение"
		],
		3: [
			"__Троллинг это плохо__. Троллинг - наглядное проявление двуличия, а также обсуждение кого-то за его спиной, что тоже не одобряется в человеческом обществе",
			"Троллинг"
		]
	},
	3: {
		0: "Дискриминация, провокация, попрошайничество, препятствование общению, запретные темы",
		1: [
			"__Боритесь с дискриминацией!__ Дискриминация - притеснение на основе каких-либо признаков, например, национальности, места проживания или возраста. __Уважайте чужие национальности и взгляды__",
			"Дискриминация"
		],
		2: [
			"__Не провоцируйте, и сами не поддавайтесь на провокации__. Провокация это способ вывести человека из себя, воздействие на него определёным образом. Спровоцированный человек не управляет своими поступками, и остановить его сложно. Поэтому мы просим не доставлять неудобства своим товарищам и самому себе. Давайте жить дружно! __Заметочка:__ чрезмерное использование \\@упоминаний - один из способов спровоцировать человека, имейте это в виду. __Ещё заметочка:__ призыв к суициду (даже в шутку) - тоже один из видов провокации, о котором не нужно забывать",
			"Провокация"
		],
		3: [
			"__Не попрошайничайте__. Будьте скромным, ибо скромность - наше всё!",
			"Попрошайничество"
		],
		4: [
			"__Не мешайте людям общаться__. Мы хотим чтобы все весело проводили время. Не препятствутей беседе, а поддержите её! __Заметк:__ намеренное создание посторонних звуков при общении в войсе, чрезмерное использование саундпада или злоупотребление программами по модификации голоса тоже попадают под это правило",
			"Помеха общению"
		],
		5: [
			"__Мы настоятельно не рекомендуем обсуждать следующие темы: нацизм/фашизм, экстремизм, темы 18+ характера, терроризм__, а также __любые темы политческого или национального характера__. Разумеется, никто не запрещает осуждать их, но желательно вообще их не затрагивать, ибо это очень тонкий лёд.",
			"Запретные темы"
		]
	},
	4: {
		0: "18+ контент, контент личного характера, шок-контент, скримеры",
		1: [
			"__18+ контента полно в интернете, но здесь ему не место__. На этом сервере 100% находятся несовершеннолетние, и наш долг - защитить их от контента подобного характера",
			"18+ контент"
		],
		2: [
			"__Ни в коем случае не сливайте чужие личные данные человека без его согласия__. Все имеют право на личную жизнь и секреты. Под это правило также попадает адрес эл.почты, номер телефона, адрес/IP и ФИО",
			"Личный контент"
		],
		3: [
			"__Шок-контент это просто ...омерзительно__, мягко говоря. Список примеров [здесь](https://wikireality.ru/wiki/%D0%A8%D0%BE%D0%BA-%D0%BA%D0%BE%D0%BD%D1%82%D0%B5%D0%BD%D1%82). Запрещены не только фото/видео, а ещё и звуки, и ссылки, ведущие на страницы с шок-контеном, и текст, описывающий контент такого характера. Просмотр шок-контента очень негативно воздействует на психику (см. [здесь](https://prosv.ru/_assets/obzh/docs/s101-108_kl8-9_ch2.pdf), например), поэтому мы категорически запрещаем публиковать его на нашем сервере",
			"Шок-контент"
		],
		4: [
			"__Предупреждайте о скримерах, громких звуках и мигающем свете__. Отправка видео без предупреждения о скримерах, громких звуках или мегающем свете, отправка голосовых сообщений/звуковых файлов, содержащих громкие звуки, без предупреждения - всё это нарушения данного правила. Берегите уши и спокойствие наших товарищей, а также здоровье эпилепсиков!",
			"Скримеры"
		]
	},
	5: {
		0: "Нарушение правил прощадки Discord",
		1: [
			"Вы должны соблюдать правила площадки Discord, внутри которой находится наш сервер. Соблюдение [условий использования](https://discord.com/terms) имеет больший приоритет, чем правила любых проектов, включая наш. [Правила сообщества](https://discord.com/guidelines) может покрыть случаи, не описанные в правилах нашего проекта",
			"Нарушение ToS"
		],
		2: [
			"Особенно хотелось бы выделить __правило о возрасте пользователей__. Своим существованием в Discord вы подтверждаете, что вам есть **13 лет**. Если выяснится, что это не так, ваш аккаунт будет заблокирован поддержкой платформы (глобально) и модерацией нашего сервера (локально)",
			"Нет 13 лет (ToS)"
		]
	},
	"СП": {
		"СП": "Не указано в правилах",
		0: "Не совсем правила",
		1: [
			"Модерация проекта выдаёт наказания на своё усмотрение. За образец берётся мнение администрации проекта. Мера пресечения и её срок зависит от множества факторов, например, от репутации участника, степени тяжести нарушения, нарушенных пунктов, наличия предупреждений и даже от реакции нарушителя на предыдущее выданное наказание. Если вы считаете, что наказание выдано неверно, обратитесь к админам через личные сообщения",
			undefined
		],
		2: [
			"Модерация проекта имеет право выдать наказание за то, что не указано в правилах. Каждый случай индивидуален, и не всегда попадает под определённый пункт в правилах. В таких случаях, в причине описывается само нарушение",
			undefined
		],
		3: [
			"Администрация сервера может редактировать правила в любой момент и не оповещать пользователей о внесённых правках. Однвако, мы постараемся говорить вам, если будет какое-то серьёзное изменение",
			undefined
		],
		4: [
			"Попытки нарушить правила и выйти сухим из воды всегда заметны. Мы будем пресекать любые попытки обхода правил. Например, один из таких очевидных \"обходов\" - открытое использование оскорблений к участникам сервера с ложными заявлениями о дружбе",
			undefined
		]
	}
};

function getRules()
{
	let result = [];

	for (const [key, value] of Object.entries(rules))
		result.push({
			title: `${key}. ${value[0]}`,
			description: `${Object.entries(value).map(([point, rule]) => (Number(point) || 0) > 0 ? `<:Rules:1235681648188719135>**\`${key}.${point}\`${rule[1] ? ` ― ${rule[1]}` : ''}**\n> ${rule[0]}` : '').join('\n\n')}`
		});
	;

	result.at(-1).description += "На самом деле, единственное правило, которое здесь действительно действует (по совместительству, главное правило интернета) - __не будь мудаком__. Война и мир выше это лишь производное от этого правила - для тех, кому нужна конкретика ~~и бюрократия~~. Будь умничкой, соблюдай правила!";

	return result;
}

//『⚔』
//[•] | [ㅤ] | [・]



import { resolveAuthors } from "../lib/resolvePinAuthors.js";
import assets from "../assets.js";

let authorsID = ["938477436906123366"];
let redactorsID;
let designersID;
let authors = await resolveAuthors(authorsID, redactorsID, designersID)

let rulesBaked = getRules();

for (const embed of rulesBaked)
    embed.color = assets.colors.ds_gray;

rulesBaked.forEach(($, i) => {
    if ($.title?.includes("Основные термины"))
    {
        rulesBaked.splice(i, 1)
        let reversed = rulesBaked.toReversed();

        $.title = $.title.replace("ТЕРМ. ", '');
        $.description = $.description?.replace("**`ТЕРМ.1`**\n> ", '').replace("<:Rules:1235681648188719135>", '');

        reversed.push($);
        rulesBaked = reversed.toReversed();
    }
});

rulesBaked.at(0).author = {
    name: "『⚔』• На страже закона",
    icon_url: "https://cdn.discordapp.com/attachments/1235673660606386206/1235680258854748222/Punish.png?ex=66b71c2b&is=66b5caab&hm=8d4d42a5daa92cdacf6e33b74ee338a573e39174e830b579f42305234dab0d40&"
};

rulesBaked.at(-1).footer = {
    text: `『⚔』• Закон превыше всего! (да-да, знаю, вам наверняка лень всё это читать, а придётся).${authors}`,
    icon_url: assets.icons.text_fighting
};

const filesBaked = [];
let stack = [];

let n = 1;
for (const embed of rulesBaked)
{
    if (n == 3)
    {
        stack.push(embed);
        filesBaked.push({ channelID: "1247877398368616530", message: { embeds: stack } });
        n = 0;
        stack = [];
    }
    else
        stack.push(embed);
    n++;
}
if (stack)
    filesBaked.push({ channelID: "1247877398368616530", message: { embeds: stack } });

filesBaked[0].messageID = "1271563621381705730";
filesBaked[1].messageID = "1271563625068367955";
filesBaked[2].messageID = "1271563628289593446";

export default filesBaked;
